Revit 2027 API
FileSaveDialog Methods
The FileSaveDialog type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from FileDialog)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSelectedModelPath |  Returns the selected file path chosen by the user.
(Inherited from FileDialog)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Show |  Shows the dialog using the stored settings.
(Inherited from FileDialog)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FileSaveDialog Class
Autodesk.Revit.UI Namespace